Tekla.Structures.Drawing.Part.Flags.InnerContours
Inner contours

Tekla.Structures.Drawing.Part.Flags.HiddenLines
Hidden lines

Tekla.Structures.Drawing.Part.Flags.OwnHiddenLines
Own hidden lines

Tekla.Structures.Drawing.Part.Flags.CenterLine
Center line

Tekla.Structures.Drawing.Part.Flags.ReferenceLine
Reference line

Tekla.Structures.Drawing.Part.Flags.OrientationMark
Orientation mark

Tekla.Structures.Drawing.Part.Flags.ConnectingSideMark
Connecting side mark

Tekla.Structures.Drawing.Part.Flags.PopMarks
Pop-marks

Tekla.Structures.Drawing.Part.Flags.Chamfers
Chamfers